In [2]:
import pandas as pd
import numpy as np

In [ ]:
students_data=[['Chetan','Data Scientist',23,2000000],['Vishwa','Data Alanyst',24,150000],['Laxman','Data Scientist',25,23000],
               ['Vinay','Data Scientist',23,140000],['Riyaz','Data Scientist',34,230000],['Naveen','Data Alanyst',23,120000],
               ['Ram','Data Alanyst',23,200000],['Krishn','Data Alanyst',25,500000]]

students_data

[['Chetan', 'Data Scientist', 23, 2000000],
 ['Vishwa', 'Data Alanyst', 24, 150000],
 ['Laxman', 'Data Scientist', 25, 23000],
 ['Vinay', 'Data Scientist', 23, 140000],
 ['Riyaz', 'Data Scientist', 34, 230000],
 ['Naveen', 'Data Alanyst', 23, 120000],
 ['Ram', 'Data Alanyst', 23, 200000],
 ['Krishn', 'Data Alanyst', 25, 500000]]

In [5]:
data=pd.DataFrame(students_data,columns=['Name','Position','Age','Salary'])
data

     Name        Position  Age   Salary
0  Chetan  Data Scientist   23  2000000
1  Vishwa    Data Alanyst   24   150000
2  Laxman  Data Scientist   25    23000
3   Vinay  Data Scientist   23   140000
4   Riyaz  Data Scientist   34   230000
5  Naveen    Data Alanyst   23   120000
6     Ram    Data Alanyst   23   200000
7  Krishn    Data Alanyst   25   500000

In [28]:
#Conditional Based
[(data.Salary>30000) & (data.Salary<=50000)]

[0    False
 1    False
 2    False
 3    False
 4    False
 5    False
 6    False
 7    False
 Name: Salary, dtype: bool]

In [17]:
data['City']=['Dharwad','Hubli','Bengalore','Belg','Dharwad','Hubli','Bengalore','Belg'] #Creating new column
data

     Name        Position  Age   Salary       City
0  Chetan  Data Scientist   23  2000000    Dharwad
1  Vishwa    Data Alanyst   24   150000      Hubli
2  Laxman  Data Scientist   25    23000  Bengalore
3   Vinay  Data Scientist   23   140000       Belg
4   Riyaz  Data Scientist   34   230000    Dharwad
5  Naveen    Data Alanyst   23   120000      Hubli
6     Ram    Data Alanyst   23   200000  Bengalore
7  Krishn    Data Alanyst   25   500000       Belg

In [20]:
#Deleting column
data.drop('Age', axis=1, inplace=True)
data

     Name        Position   Salary
0  Chetan  Data Scientist  2000000
1  Vishwa    Data Alanyst   150000
2  Laxman  Data Scientist    23000
3   Vinay  Data Scientist   140000
4   Riyaz  Data Scientist   230000
5  Naveen    Data Alanyst   120000
6     Ram    Data Alanyst   200000
7  Krishn    Data Alanyst   500000

In [24]:
#Deleting row
data.drop(0, axis=0, inplace=True)

In [25]:
data

     Name        Position  Salary
1  Vishwa    Data Alanyst  150000
2  Laxman  Data Scientist   23000
3   Vinay  Data Scientist  140000
4   Riyaz  Data Scientist  230000
5  Naveen    Data Alanyst  120000
6     Ram    Data Alanyst  200000
7  Krishn    Data Alanyst  500000

In [27]:
data['Age']=[21,34,31,30,45,36,32]

In [28]:
data

     Name        Position  Salary  Age
1  Vishwa    Data Alanyst  150000   21
2  Laxman  Data Scientist   23000   34
3   Vinay  Data Scientist  140000   31
4   Riyaz  Data Scientist  230000   30
5  Naveen    Data Alanyst  120000   45
6     Ram    Data Alanyst  200000   36
7  Krishn    Data Alanyst  500000   32

In [29]:
data[data['Age']>30]

     Name        Position  Salary  Age
2  Laxman  Data Scientist   23000   34
3   Vinay  Data Scientist  140000   31
5  Naveen    Data Alanyst  120000   45
6     Ram    Data Alanyst  200000   36
7  Krishn    Data Alanyst  500000   32

In [30]:
data[(data['Age']>30) & (data['Position']=='Data Scientist')]

     Name        Position  Salary  Age
2  Laxman  Data Scientist   23000   34
3   Vinay  Data Scientist  140000   31

## Working With Missing Data

1. Finding Missing Data

In [32]:
data = [
    {"Name": "Rahul", "Age": 25, "City": "Delhi", "Salary": 50000},
    {"Name": "Priya", "Age": None, "City": "Mumbai", "Salary": 62000},
    {"Name": "Amit", "Age": 30, "City": None, "Salary": 58000},
    {"Name": "Sneha", "Age": 28, "City": "Chennai", "Salary": None},
    {"Name": None, "Age": 35, "City": "Bangalore", "Salary": 72000},
    {"Name": "Ravi", "Age": None, "City": None, "Salary": 49000}
]
df=pd.DataFrame(data)
df

    Name   Age       City   Salary
0  Rahul  25.0      Delhi  50000.0
1  Priya   NaN     Mumbai  62000.0
2   Amit  30.0       None  58000.0
3  Sneha  28.0    Chennai      NaN
4   None  35.0  Bangalore  72000.0
5   Ravi   NaN       None  49000.0

In [33]:
df.isna()

    Name    Age   City  Salary
0  False  False  False   False
1  False   True  False   False
2  False  False   True   False
3  False  False  False    True
4   True  False  False   False
5  False   True   True   False

In [34]:
df.isna().sum()#Count the all Nan Values

Name      1
Age       2
City      2
Salary    1
dtype: int64

In [35]:
df.isna().any() #it will give Ture if atleast one value null in the data

Name      True
Age       True
City      True
Salary    True
dtype: bool

2. Removing Missing Data

In [36]:
#dropna(): remove Which row have atleast one null value

In [37]:
#dropna(thresh=3):Will romeve which row does't have atleast 3 non-Null values
df.dropna(thresh=3)

    Name   Age       City   Salary
0  Rahul  25.0      Delhi  50000.0
1  Priya   NaN     Mumbai  62000.0
2   Amit  30.0       None  58000.0
3  Sneha  28.0    Chennai      NaN
4   None  35.0  Bangalore  72000.0

3. Filling the missing data

In [43]:

data = [
    {"Age": 25, "Salary": 50000, "Experience": 2},
    {"Age": 30, "Salary": None, "Experience": 5},
    {"Age": 28, "Salary": 58000, "Experience": None},
    {"Age": None, "Salary": 62000, "Experience": 4},
    {"Age": 35, "Salary": 72000, "Experience": 8},
    {"Age": None, "Salary": 49000, "Experience": None}
]

df1=pd.DataFrame(data)
df1

    Age   Salary  Experience
0  25.0  50000.0         2.0
1  30.0      NaN         5.0
2  28.0  58000.0         NaN
3   NaN  62000.0         4.0
4  35.0  72000.0         8.0
5   NaN  49000.0         NaN

In [46]:
df1.fillna(0)
df1

    Age   Salary  Experience
0  25.0  50000.0         2.0
1  30.0      NaN         5.0
2  28.0  58000.0         NaN
3   NaN  62000.0         4.0
4  35.0  72000.0         8.0
5   NaN  49000.0         NaN

In [48]:
#filling with mean,mode and median
df1.fillna(df1.mean())

    Age   Salary  Experience
0  25.0  50000.0        2.00
1  30.0  58200.0        5.00
2  28.0  58000.0        4.75
3  29.5  62000.0        4.00
4  35.0  72000.0        8.00
5  29.5  49000.0        4.75

In [49]:
df1.fillna(df1.mode())

    Age   Salary  Experience
0  25.0  50000.0         2.0
1  30.0  50000.0         5.0
2  28.0  58000.0         5.0
3  35.0  62000.0         4.0
4  35.0  72000.0         8.0
5   NaN  49000.0         NaN

In [50]:
df1.fillna(df1.median())

    Age   Salary  Experience
0  25.0  50000.0         2.0
1  30.0  58000.0         5.0
2  28.0  58000.0         4.5
3  29.0  62000.0         4.0
4  35.0  72000.0         8.0
5  29.0  49000.0         4.5

In [51]:
df1[df1['Age']==25]

    Age   Salary  Experience
0  25.0  50000.0         2.0

In [52]:
df1.head()

    Age   Salary  Experience
0  25.0  50000.0         2.0
1  30.0      NaN         5.0
2  28.0  58000.0         NaN
3   NaN  62000.0         4.0
4  35.0  72000.0         8.0

In [53]:
df1.tail()

    Age   Salary  Experience
1  30.0      NaN         5.0
2  28.0  58000.0         NaN
3   NaN  62000.0         4.0
4  35.0  72000.0         8.0
5   NaN  49000.0         NaN

In [55]:
df1.fillna(2,inplace=True)

In [56]:
df1

    Age   Salary  Experience
0  25.0  50000.0         2.0
1  30.0      2.0         5.0
2  28.0  58000.0         2.0
3   2.0  62000.0         4.0
4  35.0  72000.0         8.0
5   2.0  49000.0         2.0

In [57]:
df1

    Age   Salary  Experience
0  25.0  50000.0         2.0
1  30.0      2.0         5.0
2  28.0  58000.0         2.0
3   2.0  62000.0         4.0
4  35.0  72000.0         8.0
5   2.0  49000.0         2.0

In [58]:
data=pd.read_csv("Netflix_Analysis.csv")
data

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",Unknown,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,Unknown,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV","Feuds, flirtations and toilet talk go down amo..."
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ...",In a city of coaching centers known to train I...
...,...,...,...,...,...,...,...,...,...,...,...,...
8802,s8803,Movie,Zodiac,David Fincher,"Mark Ruffalo, Jake Gyllenhaal, Robert Downey J...",United States,"November 20, 2019",2007,R,158 min,"Cult Movies, Dramas, Thrillers","A political cartoonist, a crime reporter and a..."
8803,s8804,TV Show,Zombie Dumb,NaN,NaN,Unknown,"July 1, 2019",2018,TV-Y7,2 Seasons,"Kids' TV, Korean TV Shows, TV Comedies","While living alone in a spooky town, a young g..."
8804,s8805,Movie,Zombieland,Ruben Fleischer,"Jesse Eisenberg, Woody Harrelson, Emma Stone, ...",United States,"November 1, 2019",2009,R,88 min,"Comedies, Horror Movies",Looking to survive in a world taken over by zo...
8805,s8806,Movie,Zoom,Peter Hewitt,"Tim Allen, Courteney Cox, Chevy Chase, Kate Ma...",United States,"January 11, 2020",2006,PG,88 min,"Children & Family Movies, Comedies","Dragged from civilian life, a former superhero..."
8806,s8807,Movie,Zubaan,Mozez Singh,"Vicky Kaushal, Sarah-Jane Dias, Raaghav Chanan...",India,"March 2, 2019",2015,TV-14,111 min,"Dramas, International Movies, Music & Musicals",A scrappy but poor boy worms his way into a ty...

In [59]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8807 entries, 0 to 8806
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       8807 non-null   object
 1   type          8807 non-null   object
 2   title         8807 non-null   object
 3   director      6173 non-null   object
 4   cast          7982 non-null   object
 5   country       8807 non-null   object
 6   date_added    8797 non-null   object
 7   release_year  8807 non-null   int64
 8   rating        8803 non-null   object
 9   duration      8804 non-null   object
 10  listed_in     8807 non-null   object
 11  description   8807 non-null   object
dtypes: int64(1), object(11)
memory usage: 825.8+ KB

In [60]:
data.isnull().sum()

show_id            0
type               0
title              0
director        2634
cast             825
country            0
date_added        10
release_year       0
rating             4
duration           3
listed_in          0
description        0
dtype: int64

In [61]:
data['director']

0       Kirsten Johnson
1                   NaN
2       Julien Leclercq
3                   NaN
4                   NaN
             ...
8802      David Fincher
8803                NaN
8804    Ruben Fleischer
8805       Peter Hewitt
8806        Mozez Singh
Name: director, Length: 8807, dtype: object

In [64]:
data['director'].mode()

0    Rajiv Chilaka
Name: director, dtype: object

In [75]:
data.loc[data['director'].isnull()==True ,'director'] = data['director'].mode()

TypeError: 'Series' object is not callable

In [71]:
data

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,NaN,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
1,s2,TV Show,Blood & Water,NaN,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",Unknown,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...
3,s4,TV Show,Jailbirds New Orleans,NaN,NaN,Unknown,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV","Feuds, flirtations and toilet talk go down amo..."
4,s5,TV Show,Kota Factory,NaN,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ...",In a city of coaching centers known to train I...
...,...,...,...,...,...,...,...,...,...,...,...,...
8802,s8803,Movie,Zodiac,David Fincher,"Mark Ruffalo, Jake Gyllenhaal, Robert Downey J...",United States,"November 20, 2019",2007,R,158 min,"Cult Movies, Dramas, Thrillers","A political cartoonist, a crime reporter and a..."
8803,s8804,TV Show,Zombie Dumb,NaN,NaN,Unknown,"July 1, 2019",2018,TV-Y7,2 Seasons,"Kids' TV, Korean TV Shows, TV Comedies","While living alone in a spooky town, a young g..."
8804,s8805,Movie,Zombieland,Ruben Fleischer,"Jesse Eisenberg, Woody Harrelson, Emma Stone, ...",United States,"November 1, 2019",2009,R,88 min,"Comedies, Horror Movies",Looking to survive in a world taken over by zo...
8805,s8806,Movie,Zoom,Peter Hewitt,"Tim Allen, Courteney Cox, Chevy Chase, Kate Ma...",United States,"January 11, 2020",2006,PG,88 min,"Children & Family Movies, Comedies","Dragged from civilian life, a former superhero..."
8806,s8807,Movie,Zubaan,Mozez Singh,"Vicky Kaushal, Sarah-Jane Dias, Raaghav Chanan...",India,"March 2, 2019",2015,TV-14,111 min,"Dramas, International Movies, Music & Musicals",A scrappy but poor boy worms his way into a ty...

In [67]:
data.isnull().sum()

show_id            0
type               0
title              0
director        2634
cast             825
country            0
date_added        10
release_year       0
rating             4
duration           3
listed_in          0
description        0
dtype: int64

In [76]:
data.fillna('ABC')

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,listed_in,description
0,s1,Movie,Dick Johnson Is Dead,Kirsten Johnson,ABC,United States,"September 25, 2021",2020,PG-13,90 min,Documentaries,"As her father nears the end of his life, filmm..."
1,s2,TV Show,Blood & Water,ABC,"Ama Qamata, Khosi Ngema, Gail Mabalane, Thaban...",South Africa,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, TV Dramas, TV Mysteries","After crossing paths at a party, a Cape Town t..."
2,s3,TV Show,Ganglands,Julien Leclercq,"Sami Bouajila, Tracy Gotoas, Samuel Jouy, Nabi...",Unknown,"September 24, 2021",2021,TV-MA,1 Season,"Crime TV Shows, International TV Shows, TV Act...",To protect his family from a powerful drug lor...
3,s4,TV Show,Jailbirds New Orleans,ABC,ABC,Unknown,"September 24, 2021",2021,TV-MA,1 Season,"Docuseries, Reality TV","Feuds, flirtations and toilet talk go down amo..."
4,s5,TV Show,Kota Factory,ABC,"Mayur More, Jitendra Kumar, Ranjan Raj, Alam K...",India,"September 24, 2021",2021,TV-MA,2 Seasons,"International TV Shows, Romantic TV Shows, TV ...",In a city of coaching centers known to train I...
...,...,...,...,...,...,...,...,...,...,...,...,...
8802,s8803,Movie,Zodiac,David Fincher,"Mark Ruffalo, Jake Gyllenhaal, Robert Downey J...",United States,"November 20, 2019",2007,R,158 min,"Cult Movies, Dramas, Thrillers","A political cartoonist, a crime reporter and a..."
8803,s8804,TV Show,Zombie Dumb,ABC,ABC,Unknown,"July 1, 2019",2018,TV-Y7,2 Seasons,"Kids' TV, Korean TV Shows, TV Comedies","While living alone in a spooky town, a young g..."
8804,s8805,Movie,Zombieland,Ruben Fleischer,"Jesse Eisenberg, Woody Harrelson, Emma Stone, ...",United States,"November 1, 2019",2009,R,88 min,"Comedies, Horror Movies",Looking to survive in a world taken over by zo...
8805,s8806,Movie,Zoom,Peter Hewitt,"Tim Allen, Courteney Cox, Chevy Chase, Kate Ma...",United States,"January 11, 2020",2006,PG,88 min,"Children & Family Movies, Comedies","Dragged from civilian life, a former superhero..."
8806,s8807,Movie,Zubaan,Mozez Singh,"Vicky Kaushal, Sarah-Jane Dias, Raaghav Chanan...",India,"March 2, 2019",2015,TV-14,111 min,"Dramas, International Movies, Music & Musicals",A scrappy but poor boy worms his way into a ty...

In [77]:
data.isnull().sum()

show_id            0
type               0
title              0
director        2634
cast             825
country            0
date_added        10
release_year       0
rating             4
duration           3
listed_in          0
description        0
dtype: int64

In [78]:
data['director'].fillna(data['director'].mode()[0])

0       Kirsten Johnson
1         Rajiv Chilaka
2       Julien Leclercq
3         Rajiv Chilaka
4         Rajiv Chilaka
             ...
8802      David Fincher
8803      Rajiv Chilaka
8804    Ruben Fleischer
8805       Peter Hewitt
8806        Mozez Singh
Name: director, Length: 8807, dtype: object

In [79]:
data.isnull().sum()

show_id            0
type               0
title              0
director        2634
cast             825
country            0
date_added        10
release_year       0
rating             4
duration           3
listed_in          0
description        0
dtype: int64

In [80]:
data['director'].fillna('Unknown')

0       Kirsten Johnson
1               Unknown
2       Julien Leclercq
3               Unknown
4               Unknown
             ...
8802      David Fincher
8803            Unknown
8804    Ruben Fleischer
8805       Peter Hewitt
8806        Mozez Singh
Name: director, Length: 8807, dtype: object

In [81]:
data.isnull().sum()

show_id            0
type               0
title              0
director        2634
cast             825
country            0
date_added        10
release_year       0
rating             4
duration           3
listed_in          0
description        0
dtype: int64

In [86]:
data['director'].fillna('Unknown')
data.isnull().sum()

show_id           0
type              0
title             0
director          0
cast            825
country           0
date_added       10
release_year      0
rating            4
duration          3
listed_in         0
description       0
dtype: int64

In [84]:
data.isnull().sum()

show_id           0
type              0
title             0
director          0
cast            825
country           0
date_added       10
release_year      0
rating            4
duration          3
listed_in         0
description       0
dtype: int64

In [87]:
data.columns

Index(['show_id', 'type', 'title', 'director', 'cast', 'country', 'date_added',
       'release_year', 'rating', 'duration', 'listed_in', 'description'],
      dtype='object')